## Mezcla de 3 DF con la funci√≥n merge

In [1]:
import pandas as pd

In [4]:
path = "../../practicas/avanzado2/pandas/merge/"

In [5]:
dfPed = pd.read_csv(path+"Pedidos.txt", sep=";")
dfPed.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [6]:
dfEmpr = pd.read_csv(path+"Empresas.txt", sep=";")
dfEmpr.head()

   id           empresa
0   1    Speedy Express
1   2    United Package
2   3  Federal Shipping

In [7]:
dfEmpl = pd.read_csv(path+"Empleados.txt", sep=";")
dfEmpl.head()

   id     nombre                     cargo
0   1    Davolio   Representante de ventas
1   2     Fuller  Vicepresidente comercial
2   3  Leverling   Representante de ventas
3   4    Peacock   Representante de ventas
4   5   Buchanan         Gerente de ventas

In [8]:
dfTotal = pd.merge(dfPed, dfEmpr, left_on="idempresa", right_on="id")
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id,empresa
0,10248,WILMK,5,3,32.38,Finlandia,3,Federal Shipping
1,10255,RICSU,9,3,148.33,Suiza,3,Federal Shipping
2,10257,HILAA,4,3,81.91,Venezuela,3,Federal Shipping
3,10259,CENTC,4,3,3.25,Mexico,3,Federal Shipping
4,10262,RATTC,8,3,48.29,Estados Unidos,3,Federal Shipping

In [9]:
dfTotal = pd.merge(dfTotal, dfEmpl, left_on="idempleado", right_on="id")
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id_x,empresa,id_y,nombre,cargo
0,10248,WILMK,5,3,32.38,Finlandia,3,Federal Shipping,5,Buchanan,Gerente de ventas
1,10320,WARTH,5,3,34.57,Finlandia,3,Federal Shipping,5,Buchanan,Gerente de ventas
2,10333,WARTH,5,3,0.59,Finlandia,3,Federal Shipping,5,Buchanan,Gerente de ventas
3,10359,SEVES,5,3,288.43,Reino Unido,3,Federal Shipping,5,Buchanan,Gerente de ventas
4,10378,FOLKO,5,3,5.44,Suecia,3,Federal Shipping,5,Buchanan,Gerente de ventas

In [12]:
dfTotal.rename(columns={"nombre":"empleado", "cargo":"puesto"}, inplace=True)
dfTotal.drop(columns=['idempleado','idempresa','id_x','id_y'], inplace=True)
dfTotal.head()

,idpedido,cliente,importe,pais,empresa,empleado,puesto
0,10248,WILMK,32.38,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
1,10320,WARTH,34.57,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
2,10333,WARTH,0.59,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
3,10359,SEVES,288.43,Reino Unido,Federal Shipping,Buchanan,Gerente de ventas
4,10378,FOLKO,5.44,Suecia,Federal Shipping,Buchanan,Gerente de ventas

In [14]:
dfTotal.to_excel("../ficheros/pedidos_total.xlsx", index=False)

### Agrupar datos con groupby

In [15]:
grupo1 = dfTotal.importe.groupby(dfTotal.pais)
type(grupo1)

pandas.core.groupby.generic.SeriesGroupBy

In [17]:
# Importe medio de los pedidos por pa√≠s
media = grupo1.mean()
type(media)

pandas.core.series.Series

In [18]:
media[:5]

pais
Alemania      92.485902
Argentina     37.411250
Austria      184.787500
Belgica       67.375789
Brasil        58.797470
Name: importe, dtype: float64

In [19]:
media['Austria']

184.7875